backend/perf/jmeter/reports/run_20260523_210029_list-cache-off/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 7200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.706111111111097,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 26.0,
    "throughput" : 327.77929527451516,
    "receivedKBytesPerSec" : 622.671294557498,
    "sentKBytesPerSec" : 133.96058112537557
  },
  "GET Booking List UPCOMING" : {
    "transaction" : "GET Booking List UPCOMING",
    "sampleCount" : 3600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.861944444444452,
    "medianResTime" : 9.0,
    "minResTime" : 4.0,
    "maxResTime" : 43.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 24.0,
    "throughput" : 163.94189170727265,
    "receivedKBytesPerSec" : 135.12398105560362,
    "sentKBytesPerSec" : 67.08169201694066
  },
  "GET Booking List HISTORY" : {
    "transaction" : "GET Booking List HISTORY",
    "sampleCount" : 3600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.55027777777778,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 28.0,
    "throughput" : 164.42861057824064,
    "receivedKBytesPerSec" : 489.19385019868463,
    "sentKBytesPerSec" : 67.12027267744588
  }
}